it/src/Catalogs/ХранилищеДанныхФорм/ХранилищеДанныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДанныхФорм</name>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФормы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

it/src/SettingsStorages/НастройкиФорм/ManagerModule.bsl
Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ХранилищеДанныхФорм.Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДанныхФорм КАК ХранилищеДанныхФорм
	               |ГДЕ
	               |	ХранилищеДанныхФорм.Пользователь = &Пользователь
	               |	И ХранилищеДанныхФорм.КлючОбъекта = &КлючОбъекта
	               |	И НЕ ХранилищеДанныхФорм.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
	
		НовыйЭлемент = Справочники.ХранилищеДанныхФорм.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= КлючНастроек;
		НовыйЭлемент.КлючОбъекта	= КлючОбъекта;
		НовыйЭлемент.Пользователь	= Пользователь;
		
		НовыйЭлемент.Записать();
		
		ХранилищеДанныхФормОбъект = НовыйЭлемент;
		
	Иначе
		Выборка.Следующий();
		ХранилищеДанныхФормОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
	КонецЕсли; 
	
	ХранилищеДанныхФормОбъект.ДанныеФормы	= Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных());
	ХранилищеДанныхФормОбъект.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ХранилищеДанныхФорм.Ссылка
	               |ИЗ
	               |	Справочник.ХранилищеДанныхФорм КАК ХранилищеДанныхФорм
	               |ГДЕ
	               |	ХранилищеДанныхФорм.Пользователь = &Пользователь
	               |	И ХранилищеДанныхФорм.КлючОбъекта = &КлючОбъекта
	               |	И НЕ ХранилищеДанныхФорм.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
	
		Выборка.Следующий();
		
		ТекущиеНастройки = Выборка.Ссылка;
		Настройки = ТекущиеНастройки.ДанныеФормы.Получить();
	
	КонецЕсли; 
	
КонецПроцедуры
